{
	"_": "->------------------------]  Chest  [------------------------<-",
	"jeiinfo.crucial.chest": "If needed, can be acquired by the standard recipe, mixing two or more types of wood.",
	
	"_": "->------------------------]  Backpack  [------------------------<-",
	"jeiinfo.crucial.backpack": "When wearing this, you'll have 27 more inventory slots. You can even dye it to look fancy!",
	"jeiinfo.crucial.ravager_hide": "This drops from Ravagers. Call in a raid to get them over.",
	
	"_": "->------------------------]  Toretoise Stuff  [------------------------<-",
	"jeiinfo.crucial.toretoises": "Toretoises can spawn this. Find them underground and feed them Cave Roots. Iron Rods can pop the ore automatically, or manually by hitting it with a Pickaxe.",
	
	"jeiinfo.crucial.minecart": "Minecarts are one of the few ways to properly move Toretoises. They get comfy in there!",
	"jeiinfo.crucial.quark_root": "These can be found underground. Stick them on a wall in a dark area to grow them.",
	
	"_": "->------------------------]  Coral Stuff  [------------------------<-",
	"jeiinfo.crucial.coralstone": "Put the respective coral block next to raw Coralstone and it'll propagate. Powering with redstone gives coral bits.",
    "jeiinfo.crucial.coral": "This can be found in reefs under warm oceans and farmed with bone meal underwater in those biomes.",
	"jeiinfo.crucial.extinct_wood": "This wood doesn't spawn naturally, you have to figure out how to make the Saplings.",
	
	"_": "->------------------------]  Wood Type  [------------------------<-",
	"jeiinfo.crucial.rainforests_wood": "This wood spawns in Rainforests.",
	"jeiinfo.crucial.dunes_wood": "This wood spawns in Dunes.",
	"jeiinfo.crucial.yucca_tree": "This spawns alongside Yucca Trees in Dunes.",
	"jeiinfo.crucial.maple_wood": "This wood spawns in Maple Forests.",
	"jeiinfo.crucial.outer_wood": "This wood spawns in the Outer End.",
	"jeiinfo.crucial.glowshroom": "This spawns underground under Mountains and Mushroom Islands.",
	"jeiinfo.crucial.grow_mushroom": "This wood can be gotten by growing mushrooms.",
	"jeiinfo.crucial.blossom": "This wood spawns in Blossom Highlands.",
	"jeiinfo.crucial.swamp_wood": "This wood spawns in Swamps.",
	"jeiinfo.crucial.flower_wood": "This wood spawns in Flower Forests.",
	"jeiinfo.crucial.driftwood": "This wood spawns in watery areas. It does not have a sapling variation, so it's in limited supply.",
	"jeiinfo.crucial.river_wood": "This wood spawns in Rivers and Beaches.",
	"jeiinfo.crucial.jacaranda": "This wood spawns in Lavender Fields and Lavender Forests.",
	"jeiinfo.crucial.redbud": "This wood spawns randomly around plains and forests.",
	"jeiinfo.crucial.cypress": "This wood spawns in Bayous.",
	
	"_": "->------------------------]  Dunes Features  [------------------------<-",
	"jeiinfo.crucial.dunes_stuff": "This spawns in Dunes.",
	"jeiinfo.crucial.arid_sand": "This spawns in Dunes. Can also be acquired by making an upwards bubble column with Arid Sandstone directly above.",
	"jeiinfo.crucial.red_arid_sand": "This spawns in Dunes. Can also be acquired by making an upwards bubble column with Red Arid Sandstone directly above.",
	
	"_": "->------------------------]  Rainforest Features  [------------------------<-",
	"jeiinfo.crucial.rainforests_stuff": "This spawns in Rainforests.",
	
	"_": "->------------------------]  Bayous Features  [------------------------<-",
	"jeiinfo.crucial.bayous_stuff": "This spawns in Bayous.",
	
	"_": "->------------------------]  Lavender Features  [------------------------<-",
	"jeiinfo.crucial.lavender_stuff": "This spawns in Lavender Fields and Lavender Forests.",
	
	"_": "->------------------------]  saguaro  [------------------------<-",
	"jeiinfo.crucial.saguaro": "This spawns in Badlands",
	
	"_": "->------------------------]  Balloons  [------------------------<-",
	"jeiinfo.crucial.balloons": "Try attaching these to fences, mobs, or even boats!",
	
	"_": "->------------------------]  runes  [------------------------<-",
	"jeiinfo.crucial.runes": "Runes can be applied to an enchanted item in an Anvil to change the color of the glow.",
	"jeiinfo.crucial.blank_rune": "Can be found in select loot chests. Can be crafted into a colored rune of any color. Will also work like a colored rune, removing any glow on an enchanted item.",
	
	"_": "->------------------------]  Speleothems  [------------------------<-",
	"jeiinfo.crucial.speleothems": "Can be placed on a solid block, up to three tall, shrinking in size every time. Falling on the lowest size will deal 50 percent increased fall damage.",
	
	"_": "->------------------------]  Cave Crystals  [------------------------<-",
	"jeiinfo.crucial.crystals": "This can be found randomly underground. They can grow if placed deep underground, look for the semi-transparent swirly particles.",
	"jeiinfo.crucial.crystal_cluster": "This can be found randomly underground and can be grown via normal Corundum. Can redirect beacon beams, provided the last one faces upwards, and can also be moved via pistons alongside adjacent Corundum blocks of the same color.",
	"jeiinfo.crucial.waxed_crystal": "Waxed variants do not emit particles or grow, but share all other properties.",
	
	"_": "->------------------------]  World Stones  [------------------------<-",
	"jeiinfo.crucial.andesite": "This spawns in large clusters under Forest type biomes.",
	"jeiinfo.crucial.diorite": "This spawns in large clusters under Savannas, Jungles, and Mushroom Islands.",
	"jeiinfo.crucial.granite": "This spawns in large clusters under Mountains.",
	"jeiinfo.crucial.basalt": "This spawns in large clusters under the Outer End.",
	"jeiinfo.crucial.brimstone": "This spawns in large clusters under Badlands.",
	"jeiinfo.crucial.cobbedstone": "This spawns in large clusters under Plains. Zombies that spawn on it, naturally or via spawners, get turned into Wrapped, which may drop Cobwebs.",
	"jeiinfo.crucial.elder_prismarine": "This spawns in large clusters under Oceans.",
	"jeiinfo.crucial.jasper": "This spawns in large clusters under Badlands and Deserts.",
	"jeiinfo.crucial.limestone": "This spawns in large clusters under Swamps and Oceans.",
	"jeiinfo.crucial.marble": "This spawns in large clusters under Plains.",
	"jeiinfo.crucial.myalite": "This spawns in large clusters on top of the Outer End.",
	"jeiinfo.crucial.permafrost": "This spawns in large clusters under icy and snowy biomes.",
	"jeiinfo.crucial.slate": "This spawns in large clusters under icy and snowy biomes.",
	"jeiinfo.crucial.deepslate": "This spawns in a large sheet towards the bottom of the world.",
	"jeiinfo.crucial.cobbled_deepslate": "Dropped by Deepslate, which spawns in a large sheet towards the bottom of the world.",
	"jeiinfo.crucial.smooth_basalt": "This spawns topping the large sheet of Deepslate towards the bottom of the world.",
	
	"_": "->------------------------]  Slime Blocks  [------------------------<-",
	"jeiinfo.crucial.slime_block": "Slime blocks will only stick to ones composed of their color or vice versa. (e.g. Red won't stick to Blue, but it'll stick to Magenta, as Magenta contains Red)",
	
	"_": "->------------------------]  Chimes  [------------------------<-",
	"jeiinfo.crucial.chimes": "This can be right clicked to remove your insomnia level without having to sleep. It also makes a nice sound!",
	
	"_": "->------------------------]  Traveller's Armor  [------------------------<-",
	"jeiinfo.crucial.architect_belt": "Part of the Traveller's Armor set. Can be bought by master level Masons, Carpenters, or Ceramists and leveled up with use.",
	"jeiinfo.crucial.healer_pouch": "Part of the Traveller's Armor set. Can be acquired via Piglin Bartering.",
	"jeiinfo.crucial.thief_hood": "Part of the Traveller's Armor set. Can be acquired rarely by killing Skeletons or Wither Skeletons and leveled up with use.",
	"jeiinfo.crucial.wanderer_boots": "Part of the Traveller's Armor set. Can be purchased from the Wandering Trader and leveled up with use.",
	
	"_": "->------------------------]  Maple Forest Features  [------------------------<-",
	"jeiinfo.crucial.foul_berries": "This spawns in Maple Forests.",
	"jeiinfo.crucial.snail": "Sourced from Snails, which spawn in Maple Forests.",
	"jeiinfo.crucial.turkey": "Sourced from Turkeys, which spawn in Maple Forests.",
	
	"_": "->------------------------]  Bee Stuff  [------------------------<-",
	"jeiinfo.crucial.beekeeper": "Get this by trading with a Beekeeper, can take honey out of hives.",
	"jeiinfo.crucial.honey_pot": "Stores honey, can take in honeycombs. It's also the Beekeeper villager workstation.",
	
	"_": "->------------------------]  Poise Forest Stuff  [------------------------<-",
	"jeiinfo.crucial.booflo_hide": "Dropped from Booflos on death or growth. They spawn in the outer end, tame them with Bolloom Fruit, and breed with Poise Clusters.",
	"jeiinfo.crucial.bolloom_fruit": "Spawns in the outer end, Puff Bug mobs can pollinate buds to make more.",
	"jeiinfo.crucial.boof_block": "Puffs up when jumped on, making it into a trampoline of sorts.",
	"jeiinfo.crucial.poise": "Spawns in the Poise Forest, located in the Outer End.",
	"jeiinfo.crucial.booflo_vest": "While worn allows for extra jumps.",
	"jeiinfo.crucial.end_corrock": "Spawns in the Outer End. Placing any other Corrock in the End will also create this.",
	"jeiinfo.crucial.nether_corrock": "Get this by placing any Corrock in the Nether.",
	"jeiinfo.crucial.overworld_corrock": "Get this by placing any Corrock in the Overworld.",
	
	"_": "->------------------------]  Random Environmental Stuff  [------------------------<-",
	"jeiinfo.crucial.yaks": "Get this by shearing Yaks, which spawn in Mountains.",
	"jeiinfo.crucial.mud": "Spawns in Swamps and Marshes.",
	"jeiinfo.crucial.lily_pad": "Get this by bone mealing a Lily Pad.",
	"jeiinfo.crucial.truffle_food": "Temporarily increases your maximum health when eaten.",
	"jeiinfo.crucial.cattail": "Get by right clicking grown Cattails. Can also be planted, but they'll only grow on farmland underwater.",
	"jeiinfo.crucial.cherries": "Can drop from Cherry Tree leaves like apples.",
	"jeiinfo.crucial.slabfish_effigy": "Can hold up to one item inside it, has no other purpose other than that and looking cool.",
	"jeiinfo.crucial.kiln": "It's faster at smelting anything a smoker and blast furnace can't. It's also the Ceramist villager workstation.",
	"jeiinfo.crucial.sawmill": "Cuts wood like a stonecutter. It's also the Carpenter villager workstation.",
	"jeiinfo.crucial.truffle": "Can be scavenged by Pigs by feeding them Golden Carrots.",
	"jeiinfo.crucial.banana": "Spawns in tropical biomes and beaches. Can be farmed by planting Fronds.",
	"jeiinfo.crucial.banana_frond": "Grows when planted on Sand or Gravel during rain. Can be bone mealed if raining.",
	"jeiinfo.crucial.strawberries": "Found in patches in Plains Biomes.",
	"jeiinfo.crucial.beanstalk": "You can get these by using Magic Beans.",
	"jeiinfo.crucial.adzuki": "Found in patches in Forest Biomes.",
	"jeiinfo.crucial.mint": "Found in patches in Mountain Biomes.",
	"jeiinfo.crucial.white_strawberries": "Can be gotten by growing strawberries at high altitudes (Y > 200).",
	"jeiinfo.crucial.vanilla": "Found in patches in Plains Savannas. Grows taller if there's adjacent solid blocks.",
	"jeiinfo.crucial.ice_cubes": "Drop from ice if broken without Silk Touch.",
	"jeiinfo.crucial.magic_beans": "Can be planted to grow large beanstalks.",
	
	"_": "->------------------------]  Savage & Ravage  [------------------------<-",
	"jeiinfo.crucial.creeper_spores": "Drops when a Creeper blows another Creeper up. Try throwing it to make friends!",
	
	"_": "->------------------------]  Upgrade Aquatic Stuff  [------------------------<-",
	"jeiinfo.crucial.beach": "Spawns in Beaches",
	"jeiinfo.crucial.glowing_ink_sac": "Dropped by Glowsquid, find them deep in oceans. Can be used to make signs glow.",
	"jeiinfo.crucial.mulberry": "Grows in river trees, can be farmed under river leaves.",
	"jeiinfo.crucial.pickerelweed": "Spawns in any body of water. Slows you down too.",
	"jeiinfo.crucial.tooth_door": "Like a wooden one, but automatically closes after a bit.",
	"jeiinfo.crucial.thrasher_tooth": "Dropped by Thrashers. Find them deep under cold and frozen oceans.",
	"jeiinfo.crucial.elder_eye": "Drops from Elder Guardians, detects mobs in front of it when enabled and sends a redstone signal.",
	"jeiinfo.crucial.elder_guardian_spine": "Drops from Elder Guardians, deals damage and mining fatigue to creatures in it when activated with redstone.",
	"jeiinfo.crucial.guardian_spine": "Drops from Guardians, deals damage to creatures in it when activated with redstone.",
	"jeiinfo.crucial.kelp": "Sold by Wandering Traders. No one really knows where they get it. Grows like normal Kelp aside from that.",
	"jeiinfo.crucial.sand": "Can be acquired by making an upwards bubble column with Sandstone directly above.",
	"jeiinfo.crucial.red_sand": "Can be acquired by making an upwards bubble column with Red Sandstone directly above.",
	"jeiinfo.crucial.gravel": "Can be acquired by making an upwards bubble column with Cobblestone directly above.",
	
	"_": "->------------------------]  Farmers Delight Materials  [------------------------<-",
	"jeiinfo.crucial.ham": "Dropped when hitting a Pig or Hoglin with a knife.",
	"jeiinfo.crucial.wild_beaches": "Wild patches spawn in Beaches.",
	"jeiinfo.crucial.wild_cold": "Wild patches spawn in Cold Climates.",
	"jeiinfo.crucial.wild_temperate": "Wild patches spawn in Temperate Climates.",
	"jeiinfo.crucial.wild_arid": "Wild patches spawn in Arid Climates.",
	"jeiinfo.crucial.wild_rice": "Wild patches spawn in Swamps and Jungles.",
	
	"_": "->------------------------]  Other Farmers Delight Things  [------------------------<-",
	"jeiinfo.crucial.basket": "Can store items like a chest. Automatically picks up anything that falls in it.",
	"jeiinfo.crucial.cooking_pot": "Put over a heat source such as fire or a stove to start cooking.",
	"jeiinfo.crucial.stove": "Serves as heat source for a Cooking Pot.",
	"jeiinfo.crucial.cutting_board": "Right click with an item and a knife to cut it.",
	"jeiinfo.crucial.rich_soil": "Can be used to plant crops. Crops planted in this will grow faster, as if bone mealed every now and then. Can be tilled into Rich Farmland, which doesn't get trampled.",
	"jeiinfo.crucial.brown_mushroom_colony": "Can be gotten by planting Brown Mushrooms on Rich Soil under sufficient darkness.",
	"jeiinfo.crucial.red_mushroom_colony": "Can be gotten by planting Red Mushrooms on Rich Soil under sufficient darkness.",
	
	"_": "->------------------------]  Quark Tweaks  [------------------------<-",
	"jeiinfo.crucial.poisonous_potato": "Feeding this to a baby animal may poison it and prevent it from growing.",
	"jeiinfo.crucial.shulker_shell": "Endermites can burrow into Purpur blocks, creating new Shulkers.",
	"jeiinfo.crucial.cobweb": "Dropped by Wrapped, which can only spawn on Cobbedstone.",
	
	"_": "->------------------------]  Quark Items  [------------------------<-",
	"jeiinfo.crucial.chorus": "Spawns in the Outer End. Teleports when touched, if touched a mob, can spawn endermites or spread.",
	"jeiinfo.crucial.crab": "Drops from Crabs, which spawn in beaches. Breed them with Wheat, Chicken, or any type of Fish.",
	"jeiinfo.crucial.glass_item_frame": "Item frame without a background. Can be right clicked through onto chests, placed onto signs, or serve as wallpaper with banners. Can also update Maps in real time.",
	"jeiinfo.crucial.ambient": "Just like a Music Disc, but plays a looping ambient sound. Can be acquired when a Skeleton kills a Spider.",
	"jeiinfo.crucial.ancient_tome": "Rare item found in loot chests. When combined in anvil with an item that already has the respective enchantment, it increases the level by one. Can also increase the enchantment level up to one past the maximum.",
	"jeiinfo.crucial.biotite": "Spawns in the middle end island after killing a dragon.",
	"jeiinfo.crucial.bottled_cloud": "Right click an empty bottle at cloud level to get this. Can place a block in midair.",
	"jeiinfo.crucial.diamond_heart": "Drops from stonelings sometimes, find them rarely underground and sneak with a diamond in hand to not scare them.",
	"jeiinfo.crucial.dragon_scale": "Drops from enderdragons summoned by a player. Can be used to duplicate Elytras.",
	"jeiinfo.crucial.soul_bead": "Drops from wraiths, in the Soul Sand Valley. When right clicked, will fly towards the nearest Nether Fortress.",
	"jeiinfo.crucial.forgotten_hat": "Drops from Forgotten skeletons, deep underground.",
	"jeiinfo.crucial.frog": "Drops from Frogs, which spawn in swamps. Breed them with Spider Eyes, or any type of Fish.",
	"jeiinfo.crucial.slime_in_a_bucket": "Right click a tiny slime to capture it. It gets excited when you're in a slime chunk!",
	
	"_": "->------------------------]  Quark Items  [------------------------<-",
	"jeiinfo.crucial.dictionary": "Consult an Animal Dictionary for more information.",
	"jeiinfo.crucial.crocodile_scute": "Sourced from Crocodiles, which spawn in Rivers and Swamps. Crocodiles may kill you. Consult an Animal Dictionary for more information.",
	"jeiinfo.crucial.animal_dictionary": "Contains information on Alex's Mobs.",
	"jeiinfo.crucial.mimicream": "Drops from Mimicubes near end cities. Consult an Animal Dictionary for more information.",
	"jeiinfo.crucial.pocket_sand": "Can be used as a longrange weapon, if you're so inclined.",
	"jeiinfo.crucial.gustmaker": "When given a redstone signal, sends a sand tornado in the direction it's facing.",
	"jeiinfo.crucial.fedora": "Do bee do bee doo ba doo",
	"jeiinfo.crucial.capsid": "Can drop from Enderiophages and used to transport items. Consult an Animal Dictionary for more information.",
	
	"_": "->------------------------]  The section that brings all the boys to the yard    [------------------------<-",
	"jeiinfo.crucial.milkshake": "When drank or fed to a creature or mob, it ",
	"jeiinfo.crucial.vanilla_milkshake": "removes all effects.",
	"jeiinfo.crucial.chocolate_milkshake": "removes all positive effects.",
	"jeiinfo.crucial.strawberry_milkshake": "removes all negative effects.",
	"jeiinfo.crucial.banana_milkshake": "swaps all effects with the nearest creature.",
	"jeiinfo.crucial.mint_milkshake": "steals all effects from the nearest creature.",
	"jeiinfo.crucial.adzuki_milkshake": "gives all effects to the nearest creature",
	"jeiinfo.crucial.yucca_milkshake": "consumes all effects, and then gives them to the next creature that attacks the drinker.",
	"jeiinfo.crucial.aloe_milkshake": "consumes all effects, and then gives them to back when the drinker is next attacked.",
	"jeiinfo.crucial.passionfruit_milkshake": "consumes all effects, and then gives them to the next creature that is attacked by the drinker.",
	"jeiinfo.crucial.pumpkin_milkshake": "redistributes the duration of effects equally.",
	"jeiinfo.crucial.sweet_berry_milkshake": "shuffles active effects' levels and durations.",
	
	"_": "->------------------------]  Unique Functional Items    [------------------------<-",
	"jeiinfo.crucial.passion_vine_coil": "Can be thrown. When it lands on a block, it drops down a vine you can climb.",
	
	"jeiinfo.crucial.atlas": "Works as a sort of map that catalogues where you go. Definitely a must have if you're going exploring!",
	
	"jeiinfo.crucial.crustose": "Can be created by growing Aspen Saplings in a 2x2 pattern.",
	"jeiinfo.crucial.bat_bucket": "Right-click a bat with an empty bucket to capture it, when you release it, you can see all nearby mobs.",
	"jeiinfo.crucial.ender_pearl_block": "Eating a Chorus Fruit close to one will teleport you to it instead.",
	"jeiinfo.crucial.endermite_powder": "Dropped by Endermites sometimes, right click to help locate the nearest End City.",
	"jeiinfo.crucial.glowball": "Can be thrown, and leaves a little glowy blob where it lands.",
	"jeiinfo.crucial.gunpowder_block": "Falls like sand or gravel, and dissolves into air if near lava.",
	"jeiinfo.crucial.raid_horn": "A rare drop from patrol leaders. Can be used to cancel raids, or to summon patrols.",
	"jeiinfo.crucial.redstone_lantern": "Turns on only when powered.",
	"jeiinfo.crucial.redstone_sand": "Emits a redstone signal like a redstone block, and also falls like sand or gravel.",
	"jeiinfo.crucial.sugar_block": "Falls like sand or gravel, and dissolves into air if near water.",
	"jeiinfo.crucial.netherite_nugget": "Can be used to reset item repair cost in an anvil.",
	
	"jeiinfo.crucial.koi_bucket": "When near a Koi fish, players are given a Serenity effect, which prevents nearby mob spawns. Find these fish in Blossom Highlands.",
	"jeiinfo.crucial.slabfish_bucket": "Slabfish can be found in Swamps and Marshes, and tamed using Tropical Fish.",
	
	"jeiinfo.crucial.charged_arrow": "Produces a 1 second long redstone signal if it hits a block.",
	"jeiinfo.crucial.north_compass": "Always points to the north.",
	"jeiinfo.crucial.redstone_charger": "Right click a block to make 1 second long redstone signal. If sneaking, it's 1 redstone tick instead.",
	"jeiinfo.crucial.collector": "Pulls items dropped or in inventories in front of it when given a redstone signal.",
	
	"jeiinfo.crucial.ender_watcher": "Emits a redstone signal when looked at by a player. The closer to the middle, the higher the signal.",
	"jeiinfo.crucial.feeding_trough": "Animals can eat and breed from this. If there's over 32 animals in a 10 block radius, they won't breed though!",
	"jeiinfo.crucial.gold_button": "Emits a 2 redstone tick long pulse.",
	"jeiinfo.crucial.grate": "Animals can't walk through this, and items fall right through.",
	"jeiinfo.crucial.gravisand": "When given a redstone signal, falls or floats upwards if it can't, also propagates this behavior. Outputs a comparator signal of 15.",
	"jeiinfo.crucial.iron_button": "Emits a 5 second long pulse.",
	"jeiinfo.crucial.iron_ladder": "Can stand without a block behind it as long as at least one ladder above it has one.",
	"jeiinfo.crucial.iron_rod": "Breaks any blocks in front when pushed by a piston. Can also be used to mine the ore on a Toretoise.",
	"jeiinfo.crucial.magnet": "Can push or pull metallic blocks when powered. When moved, stonecutters break the block above, and hoppers drop the item in front, or plant, if it's a seed.",
	"jeiinfo.crucial.myalite_crystal": "Can be found in Spiral Pillars in the outer end. If placed in a line, can redirect any enderman or ender pearl teleportations between the two ends.",
	"jeiinfo.crucial.obsidian_pressure_plate": "Only players can trigger this.",
	"jeiinfo.crucial.pipe": "Put items in with a hopper. Items prefer to flow downwards, then forwards, sideways, and lastly upwards. Disable specific pipes with a redstone signal. Items can also fall out of and into open ends.",
	"jeiinfo.crucial.redstone_inductor": "Adds up the inputs, can also be locked by pointing a repeater at it.",
	"jeiinfo.crucial.redstone_randomizer": "Randomly repeats the input to the left or right.",
	"jeiinfo.crucial.seed_pouch": "Can hold 10 stacks of a seed. Right click the seed onto it to add. Can also place 1 or 3x3 if sneaking.",
	"jeiinfo.crucial.soul_compass": "Points to where you last died.",
	"jeiinfo.crucial.trowel": "Randomly places one block from your hotbar, great for paths!",
	"jeiinfo.crucial.abacus": "Right Click a block to set the source - from there, the Abacus will count the distance from the block you're looking at to that one, provided you're holding it.",
	"jeiinfo.crucial.crate": "Can hold up to 1000 items. Unlike Chests, the amount of slots expands based on the different items you put in, so it's good for holding a high variety of things.",
	"jeiinfo.crucial.chute": "Can receive items with Hoppers and the like. Any items that end up in it are immediately ejected downwards into the world.",
	
	"jeiinfo.crucial.structured_crafter": "When powered, crafts based on the recipe in blocks or items in chests behind it in a 3x3 area.",
	
	"jeiinfo.crucial.blackboard": "You can draw in this.",
	"jeiinfo.crucial.clock_block": "Tells the time. Observers and comparators can interact with it.",
	"jeiinfo.crucial.crank": "Like a lever, but with 16 different states.",
	"jeiinfo.crucial.faucet": "When powered, pulls items or liquid from the block behind it. Can put liquids into Jars.",
	"jeiinfo.crucial.firefly_jar": "Capture a Firefly with a Jar to get this.",
	"jeiinfo.crucial.flute": "Summons any non-sitting pets around you when used. Can also right click a pet to bind it to said pet.",
	"jeiinfo.crucial.hourglass": "Fill it with sand or other dusts, outputs the remaining time with a comparator, and can be reset with a Turn Table.",
	"jeiinfo.crucial.jar": "Can store many liquids, potion, stew, cookies, fish, or tiny slimes.",
	"jeiinfo.crucial.jar_tinted": "Can capture vexes and endermites.",
	"jeiinfo.crucial.notice_board": "Can display maps, or the first page of a written book.",
	"jeiinfo.crucial.pedestal": "Can display items, including their names. Can also be stacked vertically for decor.",
	"jeiinfo.crucial.piston_launcher": "Pushes entities, like the original piston mod! You can also jump on it while it's extended.",
	"jeiinfo.crucial.planter": "Can grow crops just like irrigated farmland.",
	"jeiinfo.crucial.planter_rich": "Can grow crops just like irrigated farmland, but with the faster speed of rich soil.",
	"jeiinfo.crucial.redstone_illuminator": "Outputs a lower light level the higher the redstone signal its given.",
	"jeiinfo.crucial.sack": "Can store items, you can take it with you like a shulker box. If you try to carry multiple, it'll slow you down.",
	"jeiinfo.crucial.turn_table": "While powered, keeps rotating whatever block is attached to it. Also rotates entities on top. Right click to invert the rotation.",
	"jeiinfo.crucial.wind_vane": "Outputs a redstone signal when raining.",
	"jeiinfo.crucial.bamboo_spikes": "Can be placed in any direction. Damages entities that pass through them and deals extra fall damage. Can be tipped with potions.",
	"jeiinfo.crucial.bamboo_spikes_tipped": "Can be placed in any direction. Damages entities that pass through them, deals extra fall damage, and inflicts the potion effect.",
	"jeiinfo.crucial.bellows": "When powered fans fires and furnaces to keep them burning longer or faster. Can also push items with the wind.",
	"jeiinfo.crucial.key": "Can be used to lock Safes. Name it in an anvil before usage.",
	"jeiinfo.crucial.rope_arrow": "Places down ropes wherever it lands so you can climb up.",
	"jeiinfo.crucial.pulley_block": "Can be given ropes or chains. When rotated with a Turn Table, can drop or pull said ropes or chains back up.",
	"jeiinfo.crucial.magma_cream_block": "Works like a slime block when moved by pistons, but only one of the sides is sticky.",
	"jeiinfo.crucial.bomb": "Can be thrown, explodes on contact for explosive damage without breaking blocks.",
	"jeiinfo.crucial.raked_gravel": "Can be gotten by using a Hoe on Gravel. Doing it from different directions creates unique patterns.",
	"jeiinfo.crucial.flower_box": "Can be placed on the floor or the side of a block. Holds up to 3 flowers.",
	"jeiinfo.crucial.rotten_flesh": "Can be used to turn a Skeleton Horse into a Zombie Horse, by feeding it an entire stack.",
	"jeiinfo.crucial.slingshot": "When used, fires the first block in your hotbar as a projectile. Try using it to throw torches!",
	"jeiinfo.crucial.gold_door": "Works like a normal wooden one when unpowered. When powered, ignores interactions.",
	"jeiinfo.crucial.netherite_door": "Can be locked with Keys. If locked, only players with the appropriately named key can open it.",
	
	"jeiinfo.crucial.paraglider": "Can be found on Wild Tower chests only. When held, right click to glide.",
	
	"jeiinfo.crucial.conjurer_hat": "This is the trademark accessory of the Conjurer illager, who resides in its theatre, located in Dark Forests. While worn, it keeps Bad Omens away.",
	
	"jeiinfo.crucial.frozen_truffle": "Chilloos are known to scavenge this and other crops from the ground. You can find these creatures in cold biomes and use the Frozen Truffles to tame them.",
	
	"jeiinfo.crucial.chilloo_feather": "Chilloos shed their feathers occasionally. You can find them in cold biomes and tame them with Frozen Truffles.",
	
	"jeiinfo.crucial.thime": "Can be acquired from bartering with Seals. Consult an Animal Dictionary for more information.",
	"jeiinfo.crucial.daze": "Can be acquired by placing any Music Disc inside a Capsid.",
	"jeiinfo.crucial.leaving_home": "Can be acquired by having a Skeleton kill a Wandering Trader.",
	"jeiinfo.crucial.slabrave": "Can be acquired by giving another Music Disc to a Slabfish.",
	"jeiinfo.crucial.kilobyte": "Can be acquired from chests in End Cities.",
	"jeiinfo.crucial.fox": "Can be acquired from Foxes, who randomly spawn with it in their mouths.",
	"jeiinfo.crucial.soul_spunk": "Is rarely dropped by Embodies, which spawn in Soul Sand Valleys.",
	"jeiinfo.crucial.flush": "Is rarely dropped by Glowsquitoes, which spawn in the Glowstone Canyon biome in the Nether.",
	
	"jeiinfo.crucial.fish_barrel": "Can be cooked by placing above a fire or campfire. This will result in a slight loss of fish.",
	
	"jeiinfo.crucial.raw_iron": "Drops from Iron Ore when mined without Silk Touch. Using Fortune increases the amount dropped.",
	"jeiinfo.crucial.raw_gold": "Drops from Gold Ore when mined without Silk Touch. Using Fortune increases the amount dropped.",
	
	"jeiinfo.crucial.spyglass": "Can be used to zoom in wherever you're looking at.",
	
	"jeiinfo.crucial.flowering_oak_sapling": "Can be found in Forests and more commonly in Flowering Forests. Can be pollinated by bees during full moons to sprout apples.",
	
	"jeiinfo.crucial.entrails": "Can be acquired by trading with a Butcher Villager",
	"jeiinfo.crucial.warpstone": "Can be acquired by sending a Clay Block through a Nether Portal.",
	"jeiinfo.crucial.withered_bone": "Drops from Wither Skeletons. Not sure what you expected.",
	"jeiinfo.crucial.moonstone": "Sold only by the Wandering Trader. Glows at night.",
	"jeiinfo.crucial.sunstone": "Sold only by the Wandering Trader. Glows during the day.",
	"jeiinfo.crucial.chiseled_abyssaline_bricks": "Serves as the main source for lighting up Abyssaline blocks. Can be powered on by using a Heart of the Sea on it.",
	"jeiinfo.crucial.abyssaline": "Can be lit up by adjacent Abyssaline blocks, starting with a powered Chiseled Abyssaline Brick block.",
	"jeiinfo.crucial.acacia_totem": "Can be carved out of an Acacia Totem by taking an axe to it.",
	
	"_": "->------------------------]  Infernal Expansion stuff     [------------------------<-",
	"jeiinfo.crucial.glowstone_canyon": "Can be found in the Glowstone Canyon biome in the Nether.",
	"jeiinfo.crucial.infernalexp_path": "Can be acquired by using a hoe on the respective block.",
	"jeiinfo.crucial.infernal_painting": "Displays different art from the regular one.",
	"jeiinfo.crucial.glowcoal": "Dropped by Glowsquitoes, which can be found in the Glowstone Canyon biome in the Nether.",
	"jeiinfo.crucial.raw_hogchop": "Dropped by Hoglins.",
	"jeiinfo.crucial.glownuggets": "Dropped by mining Dullstone or Dimstone, which can be found in the Glowstone Canyon biome in the Nether.",
	"jeiinfo.crucial.blindsight_tongue": "Dropped by Blindsights, which can be found in the Glowstone Canyon biome in the Nether.",
	"jeiinfo.crucial.moth_dust": "Dropped by Glow Moths, which can be found in the Glowstone Canyon biome in the Nether.",
	"jeiinfo.crucial.molten_gold_cluster": "Can be acquired through feeding Volines gold items by dropping them. Volines can be found in Nether Wastes and Crimson Forests.",
	"jeiinfo.crucial.glowsilk": "Can be harvested from Glowsilk Cocoons and used to repair items in an anvil.",
	"jeiinfo.crucial.glowsilk_cocoon": "Can be found underground in the Nether, similarly to Ancient Debris, and harvested using a Diamond or Netherite hoe.",
	"jeiinfo.crucial.soul_salt_clump": "Dropped by Embodies, which can be found in Soul Sand Valleys.",
	"jeiinfo.crucial.ascus_bomb": "Dropped by Shroomloins, which can be found in Crimson Forests. Can be thrown to release an Infection cloud. Infection is dangerous and contagious, so be careful.",
    "jeiinfo.crucial.glowsilk_bow": "An upgrade to the standard Bow. Shoots twice as far and tips normal arrows with Luminance. Arrows with Luminance emit light and can be used to light up far away areas.",
	"jeiinfo.crucial.blindsight_tongue_whip": "A melee weapon with higher reach and knockback than usual. Must be charged by right clicking before using.",
	"jeiinfo.crucial.shroomlight_fungus": "Can be found on grown fungi in the Nether, or created by using Bone Meal on a Shroomlight block.",
	"jeiinfo.crucial.trapped_glowdust_sand": "Gives 10 seconds of Speed II when eaten.",
	"jeiinfo.crucial.trapped_glowdust_sand": "Can be found in the Glowstone Canyone biome in the Nether. Be careful, as it falls when you walk close to it.",
	"jeiinfo.crucial.basalt_iron_ore": "Can be found in the Basalt Deltas biome in the Nether.",
	"jeiinfo.crucial.magma": "Can be found in the Basalt Deltas biome in the Nether. Can be used to warm Striders or create a bubble column.",
	"jeiinfo.crucial.quartz_glass": "Can withstand explosions better than regular glass.",
	"jeiinfo.crucial.quartz_glass_pane": "Can withstand explosions better than regular glass.",
	
	"_": "->------------------------]  Unique Functional Items x2     [------------------------<-",
	"jeiinfo.crucial.oak_full_drawers_1": "Can store up to 1000 stacks of any one item. Items can be added by right-clicking and removed by left-clicking. Sneak while doing so to move entire stacks.",
	
	"jeiinfo.crucial.bundle": "Can hold up to 64 items. Right click items on it to add them and right click the Bundle item to remove them.",
	"_": "the end"
}
